parmarjh/AR-Boards/boards.txt
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

karakuri.name=karakuri Dev Module
karakuri.vid.0=0x303a
karakuri.pid.0=0x1001

karakuri.upload.tool=esptool_py
karakuri.upload.maximum_size=1310720
karakuri.upload.maximum_data_size=327680
karakuri.upload.flags=
karakuri.upload.extra_flags=
karakuri.upload.use_1200bps_touch=false
karakuri.upload.wait_for_upload_port=false

karakuri.serial.disableDTR=false
karakuri.serial.disableRTS=false

karakuri.build.tarch=xtensa
karakuri.build.bootloader_addr=0x0
karakuri.build.target=karakuri
karakuri.build.mcu=karakuri
karakuri.build.core=esp32
karakuri.build.variant=karakuri
karakuri.build.board=karakuri_DEV

karakuri.build.usb_mode=1
karakuri.build.cdc_on_boot=0
karakuri.build.msc_on_boot=0
karakuri.build.dfu_on_boot=0
karakuri.build.f_cpu=240000000L
karakuri.build.flash_size=4MB
karakuri.build.flash_freq=80m
karakuri.build.flash_mode=dio
karakuri.build.boot=qio
karakuri.build.boot_freq=80m
karakuri.build.partitions=default
karakuri.build.defines=
karakuri.build.loop_core=
karakuri.build.event_core=
karakuri.build.flash_type=qspi
karakuri.build.psram_type=qspi
karakuri.build.memory_type={build.flash_type}_{build.psram_type}

#karakuri.menu.MemoryType.default=QSPI Flash and PSRAM
#karakuri.menu.MemoryType.default.build.memory_type=qspi_qspi
#karakuri.menu.MemoryType.qspi_opi=QSPI Flash and OPI PSRAM
#karakuri.menu.MemoryType.qspi_opi.build.memory_type=qspi_opi
#karakuri.menu.MemoryType.opi_opi=OPI Flash and PSRAM
#karakuri.menu.MemoryType.opi_opi.build.memory_type=opi_opi

karakuri.menu.PSRAM.disabled=Disabled
karakuri.menu.PSRAM.disabled.build.defines=
karakuri.menu.PSRAM.disabled.build.psram_type=qspi
karakuri.menu.PSRAM.enabled=QSPI PSRAM
karakuri.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
karakuri.menu.PSRAM.enabled.build.psram_type=qspi
karakuri.menu.PSRAM.opi=OPI PSRAM
karakuri.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
karakuri.menu.PSRAM.opi.build.psram_type=opi

karakuri.menu.FlashMode.qio=QIO 80MHz
karakuri.menu.FlashMode.qio.build.flash_mode=dio
karakuri.menu.FlashMode.qio.build.boot=qio
karakuri.menu.FlashMode.qio.build.boot_freq=80m
karakuri.menu.FlashMode.qio.build.flash_freq=80m
karakuri.menu.FlashMode.qio.build.flash_type=qspi
karakuri.menu.FlashMode.qio120=QIO 120MHz
karakuri.menu.FlashMode.qio120.build.flash_mode=dio
karakuri.menu.FlashMode.qio120.build.boot=qio
karakuri.menu.FlashMode.qio120.build.boot_freq=120m
karakuri.menu.FlashMode.qio120.build.flash_freq=80m
karakuri.menu.FlashMode.qio120.build.flash_type=qspi
karakuri.menu.FlashMode.dio=DIO 80MHz
karakuri.menu.FlashMode.dio.build.flash_mode=dio
karakuri.menu.FlashMode.dio.build.boot=dio
karakuri.menu.FlashMode.dio.build.boot_freq=80m
karakuri.menu.FlashMode.dio.build.flash_freq=80m
karakuri.menu.FlashMode.dio.build.flash_type=qspi
karakuri.menu.FlashMode.opi=OPI 80MHz
karakuri.menu.FlashMode.opi.build.flash_mode=dout
karakuri.menu.FlashMode.opi.build.boot=opi
karakuri.menu.FlashMode.opi.build.boot_freq=80m
karakuri.menu.FlashMode.opi.build.flash_freq=80m
karakuri.menu.FlashMode.opi.build.flash_type=opi

karakuri.menu.FlashSize.4M=4MB (32Mb)
karakuri.menu.FlashSize.4M.build.flash_size=4MB
karakuri.menu.FlashSize.8M=8MB (64Mb)
karakuri.menu.FlashSize.8M.build.flash_size=8MB
karakuri.menu.FlashSize.8M.build.partitions=default_8MB
karakuri.menu.FlashSize.16M=16MB (128Mb)
karakuri.menu.FlashSize.16M.build.flash_size=16MB
#karakuri.menu.FlashSize.32M=32MB (256Mb)
#karakuri.menu.FlashSize.32M.build.flash_size=32MB

karakuri.menu.LoopCore.1=Core 1
karakuri.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
karakuri.menu.LoopCore.0=Core 0
karakuri.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

karakuri.menu.EventsCore.1=Core 1
karakuri.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
karakuri.menu.EventsCore.0=Core 0
karakuri.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

karakuri.menu.USBMode.hwcdc=Hardware CDC and JTAG
karakuri.menu.USBMode.hwcdc.build.usb_mode=1
karakuri.menu.USBMode.default=USB-OTG (TinyUSB)
karakuri.menu.USBMode.default.build.usb_mode=0

karakuri.menu.CDCOnBoot.default=Disabled
karakuri.menu.CDCOnBoot.default.build.cdc_on_boot=0
karakuri.menu.CDCOnBoot.cdc=Enabled
karakuri.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

karakuri.menu.MSCOnBoot.default=Disabled
karakuri.menu.MSCOnBoot.default.build.msc_on_boot=0
karakuri.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
karakuri.menu.MSCOnBoot.msc.build.msc_on_boot=1

karakuri.menu.DFUOnBoot.default=Disabled
karakuri.menu.DFUOnBoot.default.build.dfu_on_boot=0
karakuri.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
karakuri.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

karakuri.menu.UploadMode.default=UART0 / Hardware CDC
karakuri.menu.UploadMode.default.upload.use_1200bps_touch=false
karakuri.menu.UploadMode.default.upload.wait_for_upload_port=false
karakuri.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
karakuri.menu.UploadMode.cdc.upload.use_1200bps_touch=true
karakuri.menu.UploadMode.cdc.upload.wait_for_upload_port=true

karakuri.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
karakuri.menu.PartitionScheme.default.build.partitions=default
karakuri.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
karakuri.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
karakuri.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
karakuri.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
karakuri.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
karakuri.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
karakuri.menu.PartitionScheme.minimal.build.partitions=minimal
karakuri.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
karakuri.menu.PartitionScheme.no_ota.build.partitions=no_ota
karakuri.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
karakuri.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
karakuri.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
karakuri.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
karakuri.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
karakuri.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
karakuri.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
karakuri.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
karakuri.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
karakuri.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
karakuri.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
karakuri.menu.PartitionScheme.huge_app.build.partitions=huge_app
karakuri.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
karakuri.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
karakuri.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
karakuri.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
karakuri.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
karakuri.menu.PartitionScheme.fatflash.build.partitions=ffat
karakuri.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
karakuri.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
karakuri.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
karakuri.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

karakuri.menu.CPUFreq.240=240MHz (WiFi)
karakuri.menu.CPUFreq.240.build.f_cpu=240000000L
karakuri.menu.CPUFreq.160=160MHz (WiFi)
karakuri.menu.CPUFreq.160.build.f_cpu=160000000L
karakuri.menu.CPUFreq.80=80MHz (WiFi)
karakuri.menu.CPUFreq.80.build.f_cpu=80000000L
karakuri.menu.CPUFreq.40=40MHz
karakuri.menu.CPUFreq.40.build.f_cpu=40000000L
karakuri.menu.CPUFreq.20=20MHz
karakuri.menu.CPUFreq.20.build.f_cpu=20000000L
karakuri.menu.CPUFreq.10=10MHz
karakuri.menu.CPUFreq.10.build.f_cpu=10000000L

karakuri.menu.UploadSpeed.921600=921600
karakuri.menu.UploadSpeed.921600.upload.speed=921600
karakuri.menu.UploadSpeed.115200=115200
karakuri.menu.UploadSpeed.115200.upload.speed=115200
karakuri.menu.UploadSpeed.256000.windows=256000
karakuri.menu.UploadSpeed.256000.upload.speed=256000
karakuri.menu.UploadSpeed.230400.windows.upload.speed=256000
karakuri.menu.UploadSpeed.230400=230400
karakuri.menu.UploadSpeed.230400.upload.speed=230400
karakuri.menu.UploadSpeed.460800.linux=460800
karakuri.menu.UploadSpeed.460800.macosx=460800
karakuri.menu.UploadSpeed.460800.upload.speed=460800
karakuri.menu.UploadSpeed.512000.windows=512000
karakuri.menu.UploadSpeed.512000.upload.speed=512000

karakuri.menu.DebugLevel.none=None
karakuri.menu.DebugLevel.none.build.code_debug=0
karakuri.menu.DebugLevel.error=Error
karakuri.menu.DebugLevel.error.build.code_debug=1
karakuri.menu.DebugLevel.warn=Warn
karakuri.menu.DebugLevel.warn.build.code_debug=2
karakuri.menu.DebugLevel.info=Info
karakuri.menu.DebugLevel.info.build.code_debug=3
karakuri.menu.DebugLevel.debug=Debug
karakuri.menu.DebugLevel.debug.build.code_debug=4
karakuri.menu.DebugLevel.verbose=Verbose
karakuri.menu.DebugLevel.verbose.build.code_debug=5